Blog.org
#+Title: Blog
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Date: 26 December 2019
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.
#+Options: toc:nil date:t num:nil html-style:nil html-postamble:t
#+export_file_name: docs/blog.html

* TODO Picado's Interview with Lawvere                                                        :post:
:PROPERTIES:
:TITLE: Picado's Interview with Lawvere
:EXPORT_FILE_NAME: picadolawvereinterview.html
:INDEX_DATE: <2018-09-08 Sat 17:20>
:END:

[[http://www.mat.uc.pt/~picado/][Jorge Picado]] (who is also coauthor of the book on [[https://www.maa.org/press/maa-reviews/frames-and-locales-topology-without-points][locales]] I am reading) has
many nice 'popularisation of mathematics' articles on his webpage. I
have enjoyed a lot his interview with William Lawvere.

 * http://www.mat.uc.pt/~picado/lawvere/interview.pdf

Specially interesting is this criticism to the extra-mathematical
publicity around Gödel's theorem. However, I cannot locate exactly
what 'organized attempts' is he referring to.

#+BEGIN_QUOTE
In Diagonal arguments and Cartesian closed categories we demystified
the incompleteness theorem of Gödel and the truth-definition theory of
Tarski by showing that both are consequences of some very simple
algebra in the Cartesian-closed setting. It was always hard for many
to comprehend how Cantor’s mathematical theorem could be re-christened
as a “paradox” by Russell and how Gödel’s theorem could be so often
declared to be the most significant result of the 20th century.  There
was always the suspicion among scientists that such extra-mathematical
publicity movements concealed an agenda for re-establishing belief as
a substitute for science. Now, one hundred years after Gödel’s birth,
the organized attempts to harness his great mathematical work to such
an agenda have become explicit.
#+END_QUOTE


