picadolawvereinterview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-16 Wed 10:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Picado's Interview with Lawvere</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Picado's Interview with Lawvere</h1>
<p>
<a href="http://www.mat.uc.pt/~picado/">Jorge Picado</a> (who is also coauthor of the book on <a href="https://www.maa.org/press/maa-reviews/frames-and-locales-topology-without-points">locales</a> I am reading) has
many nice 'popularisation of mathematics' articles on his webpage. I
have enjoyed a lot his interview with William Lawvere.
</p>

<ul class="org-ul">
<li><a href="http://www.mat.uc.pt/~picado/lawvere/interview.pdf">http://www.mat.uc.pt/~picado/lawvere/interview.pdf</a></li>
</ul>

<p>
Specially interesting is this criticism to the extra-mathematical
publicity around Gödel's theorem. However, I cannot locate exactly
what 'organized attempts' is he referring to.
</p>

<blockquote>
<p>
In Diagonal arguments and Cartesian closed categories we demystified
the incompleteness theorem of Gödel and the truth-definition theory of
Tarski by showing that both are consequences of some very simple
algebra in the Cartesian-closed setting. It was always hard for many
to comprehend how Cantor’s mathematical theorem could be re-christened
as a “paradox” by Russell and how Gödel’s theorem could be so often
declared to be the most significant result of the 20th century.  There
was always the suspicion among scientists that such extra-mathematical
publicity movements concealed an agenda for re-establishing belief as
a substitute for science. Now, one hundred years after Gödel’s birth,
the organized attempts to harness his great mathematical work to such
an agenda have become explicit.
</p>
</blockquote>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2018-09-08 Sat 17:20. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
